<a href="https://colab.research.google.com/github/gowtham-dd/Data-Science-Basics/blob/main/SQLPythonn_Crash_Course.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import mysql.connector

connection = mysql.connector.connect(
  host = "gateway01.ap-southeast-1.prod.aws.tidbcloud.com",
  port = 4000,
  user = "4PFhDQQc2yhfCUH.root",
  password = "tzNB9UAMnXNidi62",
  database = "sampleTable",

)
mycursor = connection.cursor(buffered=True)

In [ ]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.2.0-cp311-cp311-manylinux_2_28_x86_64.whl.metadata (6.0 kB)
Downloading mysql_connector_python-9.2.0-cp311-cp311-manylinux_2_28_x86_64.whl (34.0 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 34.0/34.0 MB 36.6 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.2.0

In [ ]:
## Calculate task duration in hours
mycursor.execute("""CREATE TABLE TABLE1.CRASHCOURSE(NAME varchar(50),ROLLNO int,CLASS int,ADDRESS varchar(50))""")
out=mycursor.fetchall()#out is a variable tht fetch all details

ProgrammingError: 1050 (42S01): Table 'table1.CRASHCOURSE' already exists

In [ ]:
mycursor.execute("ALTER TABLE TABLE1.CRASHCOURSE ADD COLUMN MARKS int")

In [ ]:
mycursor.execute("""UPDATE TABLE1.CRASHCOURSE
SET MARKS = CASE
    WHEN ROLLNO = 1 THEN 10
    WHEN ROLLNO = 2 THEN 20
    WHEN ROLLNO = 3 THEN 30
    WHEN ROLLNO = 4 THEN 40
    WHEN ROLLNO = 5 THEN 50
    WHEN ROLLNO = 6 THEN 60
    WHEN ROLLNO = 7 THEN 70
    WHEN ROLLNO = 8 THEN 80
    WHEN ROLLNO = 9 THEN 90
END;""")

In [ ]:
mycursor.execute("""INSERT INTO TABLE1.CRASHCOURSE (NAME, ROLLNO, CLASS, ADDRESS) VALUES
('Gowtham', 1, '12', 'Street 1, City'),
('Meera', 2, '12', 'Street 2, City'),
('Karthik', 3, '11', 'Street 3, City'),
('Swathi', 4, '11', 'Street 4, City'),
('Ravi', 5, '10', 'Street 5, City'),
('Priya', 6, '10', 'Street 6, City'),
('Surya', 7, '9', 'Street 7, City'),
('Aarthi', 8, '9', 'Street 8, City');
""")

In [ ]:
connection.commit()

In [ ]:
mycursor.execute("""DELETE FROM TABLE1.CRASHCOURSE WHERE ADDRESS = 'xxx'
""")

In [ ]:
mycursor.execute("SELECT * FROM TABLE1.CRASHCOURSE")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
| Meera   |        2 |      12 | Street 2, City |      20 |
| Karthik |        3 |      11 | Street 3, City |      30 |
| Swathi  |        4 |      11 | Street 4, City |      40 |
| Ravi    |        5 |      10 | Street 5, City |      50 |
| Priya   |        6 |      10 | Street 6, City |      60 |
| Surya   |        7 |       9 | Street 7, City |      70 |
| Aarthi  |        8 |       9 | Street 8, City |      80 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
| Meera   |        2 |      12 | Street 2, City |      20 |
| Karthik |        3 |      11 | Street 3, City |      30 |
| Swathi  |        4 |      11 | Street 4, City |      40 |
| Ravi    |        5 |      10 | Street 5, City |      50 |
| Priya   |        6 |      10 | Street 6, City |      60 |
| Surya   |        7 |       9 | Street 7, City |      70 |
| Aarthi  |        8 |       9 | Street 8, City |      80 |
+---------+----------+---------+----------------+---------+

SELECT

In [ ]:
mycursor.execute("SELECT NAME FROM TABLE1.CRASHCOURSE ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+---------+
| NAME    |
|---------|
| GOWTHAM |
| Gowtham |
| Meera   |
| Karthik |
| Swathi  |
| Ravi    |
| Priya   |
| Surya   |
| Aarthi  |
| Gowtham |
| Meera   |
| Karthik |
| Swathi  |
| Ravi    |
| Priya   |
| Surya   |
| Aarthi  |
+---------+

In [ ]:

mycursor.execute("SELECT NAME FROM TABLE1.CRASHCOURSE WHERE ROLLNO=1")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+---------+
| NAME    |
|---------|
| GOWTHAM |
| Gowtham |
| Gowtham |
+---------+

OPERATORS

In [ ]:
mycursor.execute("SELECT MARKS,(MARKS*10) FROM TABLE1.CRASHCOURSE ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+---------+--------------+
|   MARKS |   (MARKS*10) |
|---------+--------------|
|      10 |          100 |
|      10 |          100 |
|      20 |          200 |
|      30 |          300 |
|      40 |          400 |
|      50 |          500 |
|      60 |          600 |
|      70 |          700 |
|      80 |          800 |
|      10 |          100 |
|      20 |          200 |
|      30 |          300 |
|      40 |          400 |
|      50 |          500 |
|      60 |          600 |
|      70 |          700 |
|      80 |          800 |
+---------+--------------+

In [ ]:
mycursor.execute("SELECT MARKS,(MARKS*10) AS UPDATEDMARKS FROM TABLE1.CRASHCOURSE ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+---------+----------------+
|   MARKS |   UPDATEDMARKS |
|---------+----------------|
|      10 |            100 |
|      10 |            100 |
|      20 |            200 |
|      30 |            300 |
|      40 |            400 |
|      50 |            500 |
|      60 |            600 |
|      70 |            700 |
|      80 |            800 |
|      10 |            100 |
|      20 |            200 |
|      30 |            300 |
|      40 |            400 |
|      50 |            500 |
|      60 |            600 |
|      70 |            700 |
|      80 |            800 |
+---------+----------------+

In [ ]:
mycursor.execute("SELECT DISTINCT NAME  FROM TABLE1.CRASHCOURSE ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))

+---------+
| NAME    |
|---------|
| Priya   |
| Swathi  |
| Ravi    |
| Aarthi  |
| Gowtham |
| GOWTHAM |
| Surya   |
| Meera   |
| Karthik |
+---------+

In [ ]:
mycursor.execute("SELECT NAME,MARKS,(MARKS*10) AS TOTAL  FROM TABLE1.CRASHCOURSE ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+---------+---------+
| NAME    |   MARKS |   TOTAL |
|---------+---------+---------|
| GOWTHAM |      10 |     100 |
| Gowtham |      10 |     100 |
| Meera   |      20 |     200 |
| Karthik |      30 |     300 |
| Swathi  |      40 |     400 |
| Ravi    |      50 |     500 |
| Priya   |      60 |     600 |
| Surya   |      70 |     700 |
| Aarthi  |      80 |     800 |
+---------+---------+---------+

WHERE

In [ ]:
mycursor.execute("SELECT *FROM TABLE1.CRASHCOURSE WHERE NAME='GOWTHAM'")
mycursor.execute("SELECT *FROM TABLE1.CRASHCOURSE WHERE MARKS>=10")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
| Meera   |        2 |      12 | Street 2, City |      20 |
| Karthik |        3 |      11 | Street 3, City |      30 |
| Swathi  |        4 |      11 | Street 4, City |      40 |
| Ravi    |        5 |      10 | Street 5, City |      50 |
| Priya   |        6 |      10 | Street 6, City |      60 |
| Surya   |        7 |       9 | Street 7, City |      70 |
| Aarthi  |        8 |       9 | Street 8, City |      80 |
+---------+----------+---------+----------------+---------+

In [ ]:
mycursor.execute("SELECT *FROM TABLE1.CRASHCOURSE WHERE MARKS=10")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
+---------+----------+---------+----------------+---------+

In [ ]:
mycursor.execute("DESCRIBE TABLE1.CRASHCOURSE")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+-------------+--------+-------+-----------+---------+
| Field   | Type        | Null   | Key   | Default   | Extra   |
|---------+-------------+--------+-------+-----------+---------|
| NAME    | varchar(50) | YES    |       |           |         |
| ROLLNO  | int(11)     | YES    |       |           |         |
| CLASS   | int(11)     | YES    |       |           |         |
| ADDRESS | varchar(50) | YES    |       |           |         |
| MARKS   | int(11)     | YES    |       |           |         |
+---------+-------------+--------+-------+-----------+---------+

In [ ]:
mycursor.execute("SELECT COUNT(NAME) FROM TABLE1.CRASHCOURSE")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------------+
|   COUNT(NAME) |
|---------------|
|             9 |
+---------------+

In [ ]:
mycursor.execute("SELECT SUM(MARKS) AS SUMS FROM TABLE1.CRASHCOURSE")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+--------+
|   SUMS |
|--------|
|    370 |
+--------+

In [ ]:
mycursor.execute("SELECT *FROM TABLE1.CRASHCOURSE WHERE MARKS=10 or MARKS=20")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
| Meera   |        2 |      12 | Street 2, City |      20 |
+---------+----------+---------+----------------+---------+

In [ ]:
mycursor.execute("SELECT *FROM TABLE1.CRASHCOURSE WHERE MARKS=10 or NAME='GOWTHAM'")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
+---------+----------+---------+----------------+---------+

In [ ]:
mycursor.execute("SELECT *FROM TABLE1.CRASHCOURSE WHERE MARKS BETWEEN 10 and 50")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
| Meera   |        2 |      12 | Street 2, City |      20 |
| Karthik |        3 |      11 | Street 3, City |      30 |
| Swathi  |        4 |      11 | Street 4, City |      40 |
| Ravi    |        5 |      10 | Street 5, City |      50 |
+---------+----------+---------+----------------+---------+

GROUP BY ADD FUNC MUST

In [ ]:
mycursor.execute("SELECT  AVG(MARKS),CLASS,(AVG(MARKS*10)) AS TOTAL FROM TABLE1.CRASHCOURSE GROUP BY CLASS ")
mycursor.execute("SELECT * FROM TABLE1.CRASHCOURSE ORDER BY ROLLNO DESC")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| Aarthi  |        8 |       9 | Street 8, City |      80 |
| Surya   |        7 |       9 | Street 7, City |      70 |
| Priya   |        6 |      10 | Street 6, City |      60 |
| Ravi    |        5 |      10 | Street 5, City |      50 |
| Swathi  |        4 |      11 | Street 4, City |      40 |
| Karthik |        3 |      11 | Street 3, City |      30 |
| Meera   |        2 |      12 | Street 2, City |      20 |
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
+---------+----------+---------+----------------+---------+

Here’s a **comprehensive list** of SQL functions with **examples**:

---

## **1. Aggregate Functions**
These functions perform calculations on multiple rows and return a single result.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `COUNT()` | Counts the number of rows | `SELECT COUNT(*) FROM students;` |
| `SUM()` | Returns the sum of a column | `SELECT SUM(marks) FROM students;` |
| `AVG()` | Returns the average value | `SELECT AVG(marks) FROM students;` |
| `MIN()` | Returns the minimum value | `SELECT MIN(marks) FROM students;` |
| `MAX()` | Returns the maximum value | `SELECT MAX(marks) FROM students;` |
| `GROUP_CONCAT()` | Concatenates values in a group | `SELECT GROUP_CONCAT(name) FROM students GROUP BY class;` |

---

## **2. String Functions**
These functions manipulate string values.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `CONCAT()` | Combines strings | `SELECT CONCAT(first_name, ' ', last_name) FROM employees;` |
| `SUBSTRING()` | Extracts part of a string | `SELECT SUBSTRING('Database', 1, 4); -- Data` |
| `LENGTH()` | Returns string length | `SELECT LENGTH('SQL'); -- 3` |
| `UPPER()` | Converts to uppercase | `SELECT UPPER('hello'); -- HELLO` |
| `LOWER()` | Converts to lowercase | `SELECT LOWER('HELLO'); -- hello` |
| `REVERSE()` | Reverses a string | `SELECT REVERSE('SQL'); -- LQS` |
| `REPLACE()` | Replaces substring | `SELECT REPLACE('hello world', 'world', 'SQL'); -- hello SQL` |
| `TRIM()` | Removes spaces from both sides | `SELECT TRIM('   SQL   '); -- SQL` |
| `LTRIM()` | Removes spaces from left | `SELECT LTRIM('   SQL'); -- SQL` |
| `RTRIM()` | Removes spaces from right | `SELECT RTRIM('SQL   '); -- SQL` |
| `REPEAT()` | Repeats a string | `SELECT REPEAT('SQL', 3); -- SQLSQLSQL` |

---

## **3. Date & Time Functions**
These functions work with date/time values.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `NOW()` | Returns current timestamp | `SELECT NOW();` |
| `CURDATE()` | Returns current date | `SELECT CURDATE();` |
| `CURTIME()` | Returns current time | `SELECT CURTIME();` |
| `YEAR()` | Extracts year from date | `SELECT YEAR('2024-02-25'); -- 2024` |
| `MONTH()` | Extracts month from date | `SELECT MONTH('2024-02-25'); -- 2` |
| `DAY()` | Extracts day from date | `SELECT DAY('2024-02-25'); -- 25` |
| `DATE_ADD()` | Adds interval to date | `SELECT DATE_ADD('2024-02-25', INTERVAL 10 DAY);` |
| `DATE_SUB()` | Subtracts interval from date | `SELECT DATE_SUB('2024-02-25', INTERVAL 1 MONTH);` |
| `DATEDIFF()` | Difference between two dates | `SELECT DATEDIFF('2024-12-31', '2024-02-25');` |

---

## **4. Mathematical Functions**
Perform mathematical calculations.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `ABS()` | Absolute value | `SELECT ABS(-10); -- 10` |
| `ROUND()` | Rounds a number | `SELECT ROUND(3.567, 2); -- 3.57` |
| `CEIL()` | Rounds up | `SELECT CEIL(3.1); -- 4` |
| `FLOOR()` | Rounds down | `SELECT FLOOR(3.9); -- 3` |
| `MOD()` | Remainder of division | `SELECT MOD(10, 3); -- 1` |
| `SQRT()` | Square root | `SELECT SQRT(16); -- 4` |
| `POWER()` | Exponential power | `SELECT POWER(2, 3); -- 8` |
| `RAND()` | Generates a random number | `SELECT RAND();` |

---

## **5. Conditional Functions**
Used for decision-making in queries.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `IF()` | Returns value based on condition | `SELECT IF(10>5, 'Yes', 'No'); -- Yes` |
| `IFNULL()` | Returns alternative value if NULL | `SELECT IFNULL(NULL, 'Default'); -- Default` |
| `CASE` | Executes conditional logic | ```SELECT CASE WHEN marks >= 50 THEN 'Pass' ELSE 'Fail' END FROM students;``` |

---

## **6. JSON Functions** (MySQL 5.7+)
For handling JSON data.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `JSON_EXTRACT()` | Extracts JSON values | `SELECT JSON_EXTRACT('{"name": "Alice"}', '$.name'); -- Alice` |
| `JSON_OBJECT()` | Creates JSON object | `SELECT JSON_OBJECT('name', 'Alice', 'age', 25);` |
| `JSON_ARRAY()` | Creates JSON array | `SELECT JSON_ARRAY(1, 2, 3);` |

---

## **7. Window (Analytic) Functions**
Used for ranking and running totals.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `ROW_NUMBER()` | Assigns unique row number | `SELECT name, ROW_NUMBER() OVER(ORDER BY marks) FROM students;` |
| `RANK()` | Assigns rank, skipping ties | `SELECT name, RANK() OVER(ORDER BY marks DESC) FROM students;` |
| `DENSE_RANK()` | Assigns rank without skipping | `SELECT name, DENSE_RANK() OVER(ORDER BY marks DESC) FROM students;` |
| `NTILE(n)` | Divides rows into `n` buckets | `SELECT name, NTILE(3) OVER(ORDER BY marks) FROM students;` |

---

## **8. Encryption Functions**
Used for encrypting/decrypting data.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `MD5()` | Returns MD5 hash | `SELECT MD5('password');` |
| `SHA1()` | Returns SHA1 hash | `SELECT SHA1('password');` |
| `AES_ENCRYPT()` | Encrypts with AES | `SELECT AES_ENCRYPT('data', 'key');` |
| `AES_DECRYPT()` | Decrypts AES data | `SELECT AES_DECRYPT(encrypted_data, 'key');` |

---

## **9. Other Useful Functions**
Miscellaneous functions.

| **Function** | **Description** | **Example** |
|-------------|----------------|-------------|
| `UUID()` | Generates unique ID | `SELECT UUID();` |
| `COALESCE()` | Returns first non-null value | `SELECT COALESCE(NULL, NULL, 'Value'); -- Value` |
| `FORMAT()` | Formats a number | `SELECT FORMAT(12345.678, 2); -- 12,345.68` |

---

In [ ]:
mycursor.execute("SELECT  AVG(MARKS),CLASS,(AVG(MARKS*10)) AS TOTAL FROM TABLE1.CRASHCOURSE GROUP BY CLASS ")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+--------------+---------+---------+
|   AVG(MARKS) |   CLASS |   TOTAL |
|--------------+---------+---------|
|      13.3333 |      12 | 133.333 |
|      75      |       9 | 750     |
|      35      |      11 | 350     |
|      55      |      10 | 550     |
+--------------+---------+---------+

In [ ]:
mycursor.execute("SELECT CLASS,(AVG(MARKS*10)) AS TOTAL FROM TABLE1.CRASHCOURSE GROUP BY CLASS ORDER BY CLASS  ")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+---------+
|   CLASS |   TOTAL |
|---------+---------|
|       9 | 750     |
|      10 | 550     |
|      11 | 350     |
|      12 | 133.333 |
+---------+---------+

In [ ]:
mycursor.execute("SELECT  CLASS,SUM(MARKS*10) FROM TABLE1.CRASHCOURSE GROUP BY CLASS HAVING SUM(MARKS*10)>500  ")

out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+-----------------+
|   CLASS |   SUM(MARKS*10) |
|---------+-----------------|
|       9 |            1500 |
|      11 |             700 |
|      10 |            1100 |
+---------+-----------------+

JOINS

In [ ]:
#inner join means common in A & B
mycursor.execute("INSERT INTO TABLE1.CRICKET(name) VALUES('aa'),('bb'),('cc'),('dd')"),

(None,)

In [ ]:
mycursor.execute("SELECT * FROM TABLE1.CRICKET"),
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+------+--------+
|   id | name   |
|------+--------|
|    1 | aa     |
|    2 | bb     |
|    3 | cc     |
|    4 | dd     |
+------+--------+

In [ ]:
mycursor.execute("SELECT * FROM TABLE1.FOOTBALL"),
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------------+--------+
|   Football_id | name   |
|---------------+--------|
|             1 | aaa    |
|             2 | bbb    |
|             3 | ccc    |
|             4 | ddd    |
+---------------+--------+

In [ ]:
#inner join means common in A & B
mycursor.execute("INSERT INTO TABLE1.FOOTBALL(name) VALUES('aaa'),('bbb'),('ccc'),('ddd')"),

(None,)

In [ ]:
#join
mycursor.execute("Select * from TABLE1.CRICKET as c inner join TABLE1.FOOTBALL as f on c.id=f.football_id ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+------+--------+---------------+--------+
|   id | name   |   Football_id | name   |
|------+--------+---------------+--------|
|    1 | aa     |             1 | aaa    |
|    2 | bb     |             2 | bbb    |
|    3 | cc     |             3 | ccc    |
|    4 | dd     |             4 | ddd    |
+------+--------+---------------+--------+

In [ ]:
#join
mycursor.execute("Select * from TABLE1.CRICKET as c left join TABLE1.FOOTBALL as f on c.id=f.football_id where f.name='aaa'")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+------+--------+---------------+--------+
|   id | name   |   Football_id | name   |
|------+--------+---------------+--------|
|    1 | aa     |             1 | aaa    |
+------+--------+---------------+--------+

In [ ]:
#left join gives the elements from left table
mycursor.execute("Select c.id ,c.name,f.FOOTBALL_id,f.name from TABLE1.CRICKET as c left join TABLE1.FOOTBALL as f on c.id=f.football_id ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+------+--------+---------------+--------+
|   id | name   |   FOOTBALL_id | name   |
|------+--------+---------------+--------|
|    1 | aa     |             1 | aaa    |
|    2 | bb     |             2 | bbb    |
|    3 | cc     |             3 | ccc    |
|    4 | dd     |             4 | ddd    |
+------+--------+---------------+--------+

In [ ]:
#rightjoin
mycursor.execute("Select * from TABLE1.CRICKET as c right join TABLE1.FOOTBALL as f on c.id=f.football_id ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+------+--------+---------------+--------+
|   id | name   |   Football_id | name   |
|------+--------+---------------+--------|
|    1 | aa     |             1 | aaa    |
|    2 | bb     |             2 | bbb    |
|    3 | cc     |             3 | ccc    |
|    4 | dd     |             4 | ddd    |
+------+--------+---------------+--------+

In [ ]:
#self joins joins itself
mycursor.execute("Select * from TABLE1.CRICKET as c right join TABLE1.FOOTBALL as f on c.id=f.football_id ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

In [ ]:
#self joins joins itself
mycursor.execute("Select * from TABLE1.CRICKET as c left join TABLE1.FOOTBALL as f on c.id=f.football_id UNION Select * from TABLE1.CRICKET as c right join TABLE1.FOOTBALL as f on c.id=f.football_id ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+------+--------+---------------+--------+
|   id | name   |   Football_id | name   |
|------+--------+---------------+--------|
|    1 | aa     |             1 | aaa    |
|    3 | cc     |             3 | ccc    |
|    2 | bb     |             2 | bbb    |
|    4 | dd     |             4 | ddd    |
+------+--------+---------------+--------+

In [ ]:
#self joins joins itself
mycursor.execute("SELECT NAME from TABLE1.CRASHCOURSE where MARKS=(select max(MARKS) from TABLE1.CRASHCOURSE)")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+--------+
| NAME   |
|--------|
| Aarthi |
+--------+

In [ ]:
#self joins joins itself
mycursor.execute("SELECT NAME,CLASS,MARKS from TABLE1.CRASHCOURSE where MARKS=(select max(MARKS) from TABLE1.CRASHCOURSE)")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+--------+---------+---------+
| NAME   |   CLASS |   MARKS |
|--------+---------+---------|
| Aarthi |       9 |      80 |
+--------+---------+---------+

### **Subquery in SQL**  
A **subquery** in SQL is a query nested inside another query, typically used to retrieve data that will be used in the main query. It is enclosed within parentheses and can be placed in various clauses like `SELECT`, `FROM`, or `WHERE`. A subquery is executed first, and its result is used by the outer query. Subqueries can be used to filter, compare, or compute values dynamically.

### **Types of Subqueries in SQL**  

1. **Single-Row Subquery**  
   - Returns only **one row** as a result.  
   - Used with comparison operators like `=`, `>`, `<`, `>=`, `<=`, `<>`.

2. **Multiple-Row Subquery**  
   - Returns **multiple rows** as a result.  
   - Uses operators like `IN`, `ANY`, `ALL` for comparison.

3. **Correlated Subquery**  
   - Executes once for **each row** processed in the outer query.  
   - It references columns from the outer query, making it dependent on it.

4. **Nested Subquery**  
   - A subquery inside another subquery.  
   - The innermost subquery executes first, and its result is used by the next level.

5. **Scalar Subquery**  
   - Returns a **single value (single row, single column)**.  
   - Used in `SELECT` clauses or as part of expressions.

6. **Derived Table Subquery (Inline View)**  
   - Appears in the `FROM` clause.  
   - Treated as a temporary table for the outer query.

7. **Exists Subquery**  
   - Used with `EXISTS` operator to check if any rows match the condition.  
   - Returns a boolean result (TRUE or FALSE).

Subqueries help in improving query efficiency, reducing redundancy, and structuring complex queries logically.

In [ ]:
#SELECT subquery
#self joins joins itself
mycursor.execute("SELECT avg(MARKS) as MARKS from TABLE1.CRASHCOURSE ")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+
|   MARKS |
|---------|
| 41.1111 |
+---------+

In [ ]:
#SELECT subquery
#self joins joins itself
mycursor.execute("SELECT NAME,CLASS,MARKS from TABLE1.CRASHCOURSE where MARKS<(SELECT avg(MARKS) from TABLE1.CRASHCOURSE)")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+---------+---------+
| NAME    |   CLASS |   MARKS |
|---------+---------+---------|
| GOWTHAM |      12 |      10 |
| Gowtham |      12 |      10 |
| Meera   |      12 |      20 |
| Karthik |      11 |      30 |
| Swathi  |      11 |      40 |
+---------+---------+---------+

In [ ]:
#insert
#SELECT subquery
#self joins joins itself
mycursor.execute("CREATE TABLE TABLE1.TEACHERS (NAME varchar(50),CLASS int,MARK int)")

In [ ]:
mycursor.execute("INSERT into TABLE1.TEACHERS SELECT NAME,CLASS,MARKS from TABLE1.CRASHCOURSE where MARKS>(SELECT avg(MARKS) from TABLE1.CRASHCOURSE)")

In [ ]:
mycursor.execute("SELECT * from TABLE1.TEACHERS")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+---------+--------+
| NAME    |   CLASS |   MARK |
|---------+---------+--------|
| GOWTHAM |      12 |     10 |
| Gowtham |      12 |     10 |
| Meera   |      12 |     20 |
| Karthik |      11 |     30 |
| Swathi  |      11 |     40 |
| GOWTHAM |      12 |     10 |
| Gowtham |      12 |     10 |
| Meera   |      12 |     20 |
| Karthik |      11 |     30 |
| Swathi  |      11 |     40 |
| Ravi    |      10 |     50 |
| Priya   |      10 |     60 |
| Surya   |       9 |     70 |
| Aarthi  |       9 |     80 |
+---------+---------+--------+

In [ ]:
#UPDATE
mycursor.execute("UPDATE TABLE1.CRASHCOURSE SET MARKS=MARKS+10 WHERE MARKS>(SELECT AVG(MARKS) FROM TABLE1.CRASHCOURSE)")

In [ ]:
mycursor.execute("SELECT * from TABLE1.CRASHCOURSE")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
| Meera   |        2 |      12 | Street 2, City |      20 |
| Karthik |        3 |      11 | Street 3, City |      30 |
| Swathi  |        4 |      11 | Street 4, City |      40 |
| Ravi    |        5 |      10 | Street 5, City |      60 |
| Priya   |        6 |      10 | Street 6, City |      70 |
| Surya   |        7 |       9 | Street 7, City |      80 |
| Aarthi  |        8 |       9 | Street 8, City |      90 |
+---------+----------+---------+----------------+---------+

In [ ]:
#DELETE
mycursor.execute("DELETE FROM TABLE1.CRASHCOURSE where MARKS in (SELECT MARKS FROM TABLE1.CRASHCOURSE WHERE MARKS>35)")

In [ ]:
mycursor.execute("SELECT * from TABLE1.CRASHCOURSE")
out=mycursor.fetchall()#out is a variable tht fetch all details
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))
connection.commit()

+---------+----------+---------+----------------+---------+
| NAME    |   ROLLNO |   CLASS | ADDRESS        |   MARKS |
|---------+----------+---------+----------------+---------|
| GOWTHAM |        1 |      12 | XXX            |      10 |
| Gowtham |        1 |      12 | Street 1, City |      10 |
| Meera   |        2 |      12 | Street 2, City |      20 |
| Karthik |        3 |      11 | Street 3, City |      30 |
+---------+----------+---------+----------------+---------+

TRIGGERS in SQL
Triggers in SQL
A trigger in SQL is a special type of stored procedure that automatically executes when a specific event occurs in a database. Triggers are used to enforce business rules, maintain data integrity, and automate processes without manual intervention.

Types of Triggers in SQL
Before Trigger

Executes before an insert, update, or delete operation.
Used to validate data or modify values before they are committed to the database.
After Trigger

Executes after an insert, update, or delete operation.
Commonly used for logging, auditing, or enforcing business rules.
Instead of Trigger

Overrides the normal execution of an insert, update, or delete operation.
Used mainly with views to perform custom logic instead of direct modification.
Row-Level Trigger

Executes once per row that is affected by the triggering event.
Useful when working with bulk updates or deletes.
Statement-Level Trigger

Executes once per SQL statement, regardless of the number of rows affected.
More efficient when the action needs to be performed only once per transaction.
Use Cases of Triggers
Automatic Logging: Keeping track of changes in audit tables.
Data Validation: Preventing invalid data entry.
Enforcing Business Rules: Restricting operations based on conditions.
Automating Notifications: Sending alerts or emails when specific events occur.